const translations = {
    ru: {
        homePage: {     
            title: "Ремонт часов",
            subtitle: "Ремонт часов в Харькове с качественным мастером",
            servicesTitle: "Услуги мастерской",
            experienceTitle: "Опыт мастера",
            pricingTitle: "Расценки за услугу",
            examplesTitle: "Примеры работ",
            findUsTitle: "Как нас найти?",
            deliveryText: "ПРИНИМАЕМ ЗАКАЗЫ СО ВСЕЙ УКРАИНЫ ПО ПОЧТЕ!",
            description: "Я – опытный часовщик с более чем 20-летним стажем. Работаю с любыми видами часов – от классических механических до современных кварцевых и автоматических моделей. Любая поломка – это вызов, который я с удовольствием принимаю. Отреставрирую, настрою и верну вашим часам идеальную точность и внешний вид. Гарантирую качественный ремонт и индивидуальный подход к каждому заказу. Ваши часы – в надежных руках!",
            adress: "Адрес мастерской: Харьков, Полтавский Шлях 31 офисный центр, офис 311",
            buttons: {
              consultation: "Бесплатная консультация",
              checkPrices: "Узнать расценки",
              bookAppointment: "Записаться на консультацию",
              viewAllPrices: "Смотреть все расценки",
              viewMore: "Смотреть больше",
            }},    

        ServiceCards: {
        MechaicWatch: "Ремонт механических часов",
        Battery: "Замена элементов питания",
        Polishing: "Полировка часов",
        Сleaning: "Чистка и смазка часов",
        Straps: "Замена ремешка или браслета",
        Capital: "Капитальный ремонт часов"
        },

        ServicesList: {
            StrapReplacement: { name: "Замена ремешка или браслета", price: "от 600 грн", duration: "1-2 дня" },
            BatteryReplacement: { name: "Замена батарейки", price: "от 300 грн", duration: "1-2 дня" },
            GlassReplacement: { name: "Замена стекла", price: "от 400 грн", duration: "1-2 дня" },
            WaterproofProtection: { name: "Водонепроницаемая защита", price: "от 500 грн", duration: "2-3 дня" },
            Polishing: { name: "Полировка корпуса и браслета", price: "от 1000 грн", duration: "2-3 дня" },
            AccuracyCheck: { name: "Проверка точности хода", price: "от 200 грн", duration: "1-2 дня" },
            AntiqueRestoration: { name: "Реставрация антикварных часов", price: "от 3000 грн", duration: "7+ дней" },
            WaterproofUpdate: { name: "Обновление водозащиты", price: "от 800 грн", duration: "2-3 дня" },
            Overhaul: { name: "Капитальный ремонт часов", price: "от 500 грн", duration: "2-3 дня" },
            HandsDialReplacement: { name: "Замена стрелок и циферблата", price: "от 800 грн", duration: "2-3 дня" },
            CleaningLubrication: { name: "Чистка и смазка", price: "от 600 грн", duration: "1-2 дня" },
            ChronographRepair: { name: "Ремонт или замена механизма хронограф", price: "от 2000 грн", duration: "3-4 дня" },
            PendulumClockRepair: { name: "Ремонт и настройка механизма маятниковых часов", price: "от 600 грн", duration: "7+ дней" },
            MechanismRestoration: { name: "Восстановление механизма", price: "от 1000 грн", duration: "3+ дней" },
            PendulumMechanismRepair: { name: "Ремонт маятниковых механизмов", price: "от 1200 грн", duration: "4+ дней" },
            AntiqueMechanismRepair: { name: "Ремонт и восстановление механизма старинных часов", price: "от 2000 грн", duration: "4-5 дней" },
            FullAntiqueCleaning: { name: "Полная разборка и чистка старинных часов", price: "от 2000 грн", duration: "3-4 дня" }
        },

          form: {
            title: "Записаться на консультацию",
            namePlaceholder: "Ваше имя",
            phonePlaceholder: "Номер телефона",
            submitButton: "Записаться",
            waitMessage: "Подождите",
            successMessage: "Форма успешно отправлена!",
            errorMessage: "Ошибка отправки. Попробуйте снова."
        },

        mechanicRepairPage: {
            title: "Ремонт механических часов",
            subtitle: "Часы, которые всегда идут точно",
            description1: "Механические часы – это не просто инструмент измерения времени, а сложный механизм, требующий бережного ухода. В нашей мастерской мы проводим комплексный ремонт часов любой сложности: от очистки и смазки до замены деталей и настройки точности хода. Опытные часовщики работают с вниманием к каждой детали, используя профессиональное оборудование и оригинальные комплектующие. Доверьте нам ваши часы – и они будут работать безупречно долгие годы!",
            advantagesTitle: "Преимущества ремонта часов у нас:",
            advantages: [
                "Продление срока службы – регулярное обслуживание предотвращает серьезные поломки.",
                "Точность хода – настройка механизма гарантирует стабильную работу без отклонений.",
                "Оригинальные детали – используем только проверенные комплектующие.",
                "Гарантия качества – после ремонта ваши часы будут работать как новые.",
                "Опытные мастера – доверяйте профессионалам с многолетним стажем."
            ],
            examplesTitle: "Примеры работ",
        },
    },
    ua: {
        homePage: {
            title: "Ремонт годинників",
            subtitle: "Ремонт годинників у Харкові з якісним майстром",
            servicesTitle: "Послуги майстерні",
            experienceTitle: "Досвід майстра",
            pricingTitle: "Розцінки за послугу",
            examplesTitle: "Приклади робіт",
            findUsTitle: "Як нас знайти?",
            deliveryText: "ПРИЙМАЄМО ЗАМОВЛЕННЯ З УСІЄЇ УКРАЇНИ ПОШТОЮ!",
            description: "Я – досвідчений годинникар із більш ніж 20-річним стажем. Працюю з будь-якими видами годинників – від класичних механічних до сучасних кварцових та автоматичних моделей. Будь-яка поломка – це виклик, який я із задоволенням приймаю. Відреставрую, налаштую і поверну вашим годинникам ідеальну точність і зовнішній вигляд. Гарантую якісний ремонт та індивідуальний підхід до кожного замовлення. Ваш годинник – у надійних руках!",
            adress: "Адресса майстерні: Харків, Полтавський Шлях 31 офісний центр, офіс 311",
            buttons: {
              consultation: "Безкоштовна консультація",
              checkPrices: "Дізнатися розцінки",
              bookAppointment: "Записатися на консультацію",
              viewAllPrices: "Дивитися всі розцінки",
              viewMore: "Дивитися більше!",
            }
        },
        ServiceCards: {
            MechaicWatch: "Ремонт механічних годинників",
            Battery: "Заміна елментів живлення",
            Polishing: "Полірування годинників",
            Сleaning: "Чистка та замазка годинників",
            Straps: "Заміна ремінця або браслета",
            Capital: "Капітальний ремонт годинників"
            },

            ServicesList: {
                StrapReplacement: { name: "Заміна ремінця або браслета", price: "від 600 грн", duration: "1-2 дні" },
                BatteryReplacement: { name: "Заміна батарейки", price: "від 300 грн", duration: "1-2 дні" },
                GlassReplacement: { name: "Заміна скла", price: "від 400 грн", duration: "1-2 дні" },
                WaterproofProtection: { name: "Водонепроникний захист", price: "від 500 грн", duration: "2-3 дні" },
                Polishing: { name: "Полірування корпусу та браслета", price: "від 1000 грн", duration: "2-3 дні" },
                AccuracyCheck: { name: "Перевірка точності ходу", price: "від 200 грн", duration: "1-2 дні" },
                AntiqueRestoration: { name: "Реставрація антикварного годинника", price: "від 3000 грн", duration: "7+ днів" },
                WaterproofUpdate: { name: "Оновлення водозахисту", price: "від 800 грн", duration: "2-3 дні" },
                Overhaul: { name: "Капітальний ремонт годинника", price: "від 500 грн", duration: "2-3 дні" },
                HandsDialReplacement: { name: "Заміна стрілок і циферблата", price: "від 800 грн", duration: "2-3 дні" },
                CleaningLubrication: { name: "Чистка та змащення", price: "від 600 грн", duration: "1-2 дні" },
                ChronographRepair: { name: "Ремонт або заміна механізму хронографа", price: "від 2000 грн", duration: "3-4 дні" },
                PendulumClockRepair: { name: "Ремонт і налаштування механізму маятникового годинника", price: "від 600 грн", duration: "7+ днів" },
                MechanismRestoration: { name: "Відновлення механізму", price: "від 1000 грн", duration: "3+ дні" },
                PendulumMechanismRepair: { name: "Ремонт маятникових механізмів", price: "від 1200 грн", duration: "4+ дні" },
                AntiqueMechanismRepair: { name: "Ремонт і відновлення механізму старовинного годинника", price: "від 2000 грн", duration: "4-5 днів" },
                FullAntiqueCleaning: { name: "Повне розбирання та чистка старовинного годинника", price: "від 2000 грн", duration: "3-4 дні" }
            },
            

              form: {
                title: "Записатися на консультацію",
                namePlaceholder: "Ваше ім'я",
                phonePlaceholder: "Номер телефону",
                submitButton: "Записатися",
                waitMessage: "Зачекайте",
                successMessage: "Форму успішно відправлено!",
                errorMessage: "Помилка відправки. Спробуйте знову."
            },

        mechanicRepairPage: {
            title: "Ремонт механічних годинників",
            subtitle: "Годинники, які завжди йдуть точно",
            description1: "Механічні годинники – це не просто інструмент вимірювання часу, а складний механізм, що потребує дбайливого догляду. У нашій майстерні ми проводимо комплексний ремонт годинників будь-якої складності: від очищення та змащення до заміни деталей і налаштування точності ходу. Досвідчені годинникарі працюють з увагою до кожної деталі, використовуючи професійне обладнання та оригінальні комплектуючі. Довірте нам ваш годинник – і він працюватиме бездоганно багато років!",
            advantagesTitle: "Переваги ремонту годинників у нас:",
            advantages: [
                "Продовження терміну служби – регулярне обслуговування запобігає серйозним поломкам.",
                "Точність ходу – налаштування механізму гарантує стабільну роботу без відхилень.",
                "Оригінальні деталі – використовуємо тільки перевірені комплектуючі.",
                "Гарантія якості – після ремонту ваш годинник працюватиме як новий.",
                "Досвідчені майстри – довіряйте професіоналам з багаторічним стажем."
            ],
            examplesTitle: "Приклади робіт",
        },
    }
  };
  
  export default translations;
  