import { title } from "framer-motion/client";

const translations = {
    ru: {
        siteHeading: {
            title: "Мастерская время"
        },

        repairForm: {
            title: "Записаться на ремонт",
            paragraph: "Запишите ваши данные и мы с вами свяжемся как только сможем,ожидание может составлять 1-2 дня",
            description: "Опишите свою проблему",
            name: "Ваше имя",
            email: "Ваш email",
            book: "Записаться",
            send: "Отправка...",
        },

        homePage: {     
            title: "Ремонт часов",
            subtitle: "Ремонт часов в Харькове с качественным мастером",
            servicesTitle: "Услуги мастерской",
            experienceTitle: "Опыт мастера",
            pricingTitle: "Расценки за услугу",
            examplesTitle: "Примеры работ",
            findUsTitle: "Как нас найти?",
            deliveryText: "ПРИНИМАЕМ ЗАКАЗЫ СО ВСЕЙ УКРАИНЫ ПО ПОЧТЕ!",
            description: "Я – опытный часовщик с более чем 20-летним стажем. Работаю с любыми видами часов – от классических механических до современных кварцевых и автоматических моделей. Любая поломка – это вызов, который я с удовольствием принимаю. Отреставрирую, настрою и верну вашим часам идеальную точность и внешний вид. Гарантирую качественный ремонт и индивидуальный подход к каждому заказу. Ваши часы – в надежных руках!",
            adress: "Адрес мастерской: Харьков, Полтавский Шлях 31 офисный центр, офис 311",
            buttons: {
              consultation: "Бесплатная консультация",
              checkPrices: "Узнать расценки",
              bookAppointment: "Записаться на консультацию",
              viewAllPrices: "Смотреть все расценки",
              viewMore: "Смотреть больше",
            }},   

        beforeAfter: {
            before: "До",
            after: "После"
        },
            
        poloshingPage: {
            title: "Полировка Часов",
            subtitle: "Качественное полирование из разных материалов",

            explanatio1: "Что такое полировка часов?",
            description1: "Полирование часов – это процесс удаления царапин, потертостей и мелких дефектов с корпуса и браслета часов, чтобы восстановить их первоначальный блеск. Оно бывает нескольких видов: Обычное полирование – удаляет мелкие царапины и восстанавливает глянец. Сатинирование (шлифовка) – создает матовую текстуру на металлических поверхностях. Глубокая реставрация – включает устранение более серьезных повреждений и восстановление геометрии корпуса.",
            
            explanatio2: "Что такое полировка часов?",
            descriptionPoint2: "Полировку выполняют вручную или на специальных станках, а для дорогих часов используют щадящие методы, чтобы сохранить оригинальные формы. Важно не злоупотреблять процедурой, так как частые полировки могут стереть детали корпуса.",
            sectionHeading: "Примеры работ",


            buttons: {
                call: "Позвонить нам"
            }
        },

        marriagePage: { 
            title: "МАРЬЯЖ ЧАСОВ МОЛНИЯ СССР 3602",
            subtitle: "Вторая жизнь легендарного механизма в новом обличии.",  
            explanatio1: "Что такое марьяж Молнии?", 
            description1: "Марьяж — это искусство перерождения классики. Мы берем за основу легендарный механизм «Молния» 3602, произведенный в СССР, и переносим его из карманного корпуса в современный наручный. Это позволяет не просто сохранить семейную реликвию, но и превратить её в стильный аксессуар, который удобно носить каждый день. Наши мастера проводят полную профилактику калибра, чтобы точность хода соответствовала самым высоким стандартам. Доверьте нам создание ваших уникальных часов с историей!",
            explanatio2: "Преимущества марьяжа у нас:",
            descriptionPoint1: "Легендарный механизм — работаем с аутентичными калибрами 3602, известными своей надежностью.",
            descriptionPoint2: "Индивидуальный дизайн — подбор корпуса, циферблата и стрелок под ваш персональный стиль.",
            descriptionPoint3: "Полное обслуживание — обязательный репассаж (чистка, смазка, настройка) перед установкой в корпус.",
            sectionHeading: "Примеры работ"
        },

        pricePage: {
            title: "Расценки",
            subtitle: "Самые технологичные работы в Харькове",
            redText: "ПРИНИМАЕМ ЗАКАЗЫ СО ВСЕЙ УКРАИНЫ ПО ПОЧТЕ!",
            service: "Услуга",
            cost: "Цена",
            duration: "Срок"
        },

        ServiceCards: {
        MechaicWatch: "Ремонт механических часов",
        Battery: "Замена элементов питания",
        Polishing: "Полировка часов",
        Сleaning: "Чистка и смазка часов",
        Straps: "Замена ремешка или браслета",
        Capital: "Капитальный ремонт часов"
        },

        ServicesList: {
            StrapReplacement: { name: "Замена ремешка или браслета", price: "от 600 грн", duration: "1-2 дня" },
            BatteryReplacement: { name: "Замена батарейки", price: "от 300 грн", duration: "1-2 дня" },
            GlassReplacement: { name: "Замена стекла", price: "от 400 грн", duration: "1-2 дня" },
            WaterproofProtection: { name: "Водонепроницаемая защита", price: "от 500 грн", duration: "2-3 дня" },
            Polishing: { name: "Полировка корпуса и браслета", price: "от 1000 грн", duration: "2-3 дня" },
            AccuracyCheck: { name: "Проверка точности хода", price: "от 200 грн", duration: "1-2 дня" },
            AntiqueRestoration: { name: "Реставрация антикварных часов", price: "от 3000 грн", duration: "7+ дней" },
            WaterproofUpdate: { name: "Обновление водозащиты", price: "от 800 грн", duration: "2-3 дня" },
            Overhaul: { name: "Капитальный ремонт часов", price: "от 500 грн", duration: "2-3 дня" },
            HandsDialReplacement: { name: "Замена стрелок и циферблата", price: "от 800 грн", duration: "2-3 дня" },
            CleaningLubrication: { name: "Чистка и смазка", price: "от 600 грн", duration: "1-2 дня" },
            ChronographRepair: { name: "Ремонт или замена механизма хронограф", price: "от 2000 грн", duration: "3-4 дня" },
            PendulumClockRepair: { name: "Ремонт и настройка механизма маятниковых часов", price: "от 600 грн", duration: "7+ дней" },
            MechanismRestoration: { name: "Восстановление механизма", price: "от 1000 грн", duration: "3+ дней" },
            PendulumMechanismRepair: { name: "Ремонт маятниковых механизмов", price: "от 1200 грн", duration: "4+ дней" },
            AntiqueMechanismRepair: { name: "Ремонт и восстановление механизма старинных часов", price: "от 2000 грн", duration: "4-5 дней" },
            FullAntiqueCleaning: { name: "Полная разборка и чистка старинных часов", price: "от 2000 грн", duration: "3-4 дня" }
        },

          form: {
            title: "Записаться на консультацию",
            namePlaceholder: "Ваше имя",
            phonePlaceholder: "Номер телефона",
            submitButton: "Записаться",
            waitMessage: "Подождите",
            successMessage: "Форма успешно отправлена!",
            errorMessage: "Ошибка отправки. Попробуйте снова."
        },

        mechanicRepairPage: {
            title: "Ремонт механических часов",
            subtitle: "Часы, которые всегда идут точно",
            question: "Что такое механические часы?",
            description1: "Механические часы – это не просто инструмент измерения времени, а сложный механизм, требующий бережного ухода. В нашей мастерской мы проводим комплексный ремонт часов любой сложности: от очистки и смазки до замены деталей и настройки точности хода. Опытные часовщики работают с вниманием к каждой детали, используя профессиональное оборудование и оригинальные комплектующие. Доверьте нам ваши часы – и они будут работать безупречно долгие годы!",
            advantagesTitle: "Преимущества ремонта часов у нас:",
            advantages: [
                "Продление срока службы – регулярное обслуживание предотвращает серьезные поломки.",
                "Точность хода – настройка механизма гарантирует стабильную работу без отклонений.",
                "Оригинальные детали – используем только проверенные комплектующие.",
                "Гарантия качества – после ремонта ваши часы будут работать как новые.",
                "Опытные мастера – доверяйте профессионалам с многолетним стажем."
            ],
            examplesTitle: "Примеры работ",

            buttons: {
                call: "Позвонить нам"
            }
        },

        batteryPage: {
            title: "Замена элементов питания",
            subtitle: "Качественное полирование из разных материалов",
            
            explanatio1: "Что такое замена элементов питания?",
            description1: "Если ваши часы остановились или начали отставать, скорее всего, им требуется замена элемента питания. Мы профессионально заменим батарейку в любых наручных, карманных и настенных часах, используя качественные источники питания, соответствующие вашему механизму. Процедура выполняется аккуратно, с проверкой контактов и герметичности корпуса, чтобы часы снова работали без сбоев. Доверьте нам замену батарейки – и ваши часы прослужат еще долгие годы!",
        
            explanatio2: "Преимущества замены батарейки у нас:",
            descriptionPoin1: "Быстро и безопасно – замена занимает всего несколько минут.",
            descriptionPoin2: "Оригинальные батарейки – используем только проверенные и долговечные элементы.",
            descriptionPoin3: "Сохранение герметичности – проверяем и восстанавливаем защиту от влаги.",
            descriptionPoin4: "Продление жизни механизма – своевременная замена предотвращает окисление контактов.",
            descriptionPoin5: "Гарантия на работу – уверены в качестве каждой замены!",
            sectionHeading: "Примеры работ",


            buttons: {
                call: "Позвонить нам"
            }
        },

        cleaningPage: {
            title: "Чистка и смазка часов",
            subtitle: "Поддерживаем ваш механизм в отличном состоянии",
            
            explanatio1: "Что такое смазка и чистка часов?",
            description1: "Со временем в механизме часов накапливаются пыль и микрочастицы, которые ухудшают работу и точность хода. Смазка высыхает, что приводит к износу деталей. Профессиональная чистка и смазка помогают восстановить идеальную работу механизма. В нашей мастерской мы аккуратно разбираем часы, очищаем все элементы, обновляем смазку и собираем их заново, чтобы продлить срок службы и вернуть точность.",
        
            explanatio2: "Преимущества смазки и чистки часов у нас:",
            descriptionPoin1: "Продление срока службы – регулярный уход предотвращает износ деталей.",
            descriptionPoin2: "Идеальная точность – устранение загрязнений восстанавливает стабильный ход.",
            descriptionPoin3: "Оригинальные смазочные материалы – используем только качественные масла.",
            descriptionPoin4: "Безопасность процесса – чистка проводится профессиональными инструментами.",
            descriptionPoin5: "Гарантия результата – ваши часы будут работать, как новые!",
            sectionHeading: "Приклади робіт",
        
            buttons: {
                call: "Позвонить нам"
            }
        },

        strapPage: {
            title: "Замена ремешка или браслета",
            subtitle: "Люксовые ремешки премиального качество",
            
            explanatio1: "Что такое ремешок?",
            description1: "Ремешок – это не только функциональная часть часов, но и важный элемент их стиля. Со временем он изнашивается, теряет внешний вид или просто перестает быть удобным. Мы поможем подобрать и заменить ремешок или браслет на новый – кожаный, силиконовый, тканевый или металлический. Замена проводится аккуратно, с учетом особенностей крепления, чтобы часы надежно сидели на руке и выглядели безупречно.",
        
            explanatio2: "Преимущества замены ремешка именно  нас",
            descriptionPoin1: "Широкий выбор – кожаные, металлические, силиконовые и другие варианты.",
            descriptionPoin2: "Идеальная посадка – подбираем и регулируем ремешок для максимального комфорта.",
            descriptionPoin3: "Качество и надежность – работаем только с проверенными материалами.",
            descriptionPoin4: "Быстрая замена – установка занимает всего несколько минут.",
            descriptionPoin5: "Обновленный стиль – сделайте ваши часы еще элегантнее и удобнее.",
            sectionHeading: "Приклади робіт",
        
            buttons: {
                call: "Зателефонувати нам"
            }
        },

        capital: {
            title: "Капитальный ремонт часов",
            subtitle: "Капитальный ремонт с приятными мастерами",
            
            explanatio1: "Что такое капитальный ремонт часов?",
            description1: "Капитальный ремонт часов – это комплексная процедура, позволяющая восстановить их точность и продлить срок службы. Со временем детали изнашиваются, смазка теряет свойства, а механизмы загрязняются. В ходе ремонта мы полностью разбираем часы, очищаем и смазываем каждую деталь, заменяем изношенные элементы и настраиваем точность хода. После капитального ремонта ваши часы снова будут работать как новые!",
        
            explanatio2: "Преимущества капитального ремонта у нас:",
            descriptionPoin1: "Полное восстановление механизма – устраняем все возможные неисправности.",
            descriptionPoin2: "Точность хода – после регулировки часы будут работать без отклонений.",
            descriptionPoin3: "Замена изношенных деталей – используем только оригинальные или аналогичные комплектующие.",
            descriptionPoin4: "Профессиональная чистка и смазка – механизму возвращается плавность работы.",
            descriptionPoin5: "Гарантия качества – уверены в результате каждого ремонта!",
            sectionHeading: "Приклади робіт",
        
            buttons: {
                call: "Позвонить нам"
            }
        },

        delivery: {
            title: "Доставка",
            subtitle: "Гарантируем сохранность и скорость",
            question: "Какими почтами можно отправить часы?",
            description1: "Вы можете отправить нам ваш товар любой удобной почтовой службой. Мы проведем ремонт максимально быстро и отправим его обратно в надежной упаковке. Гарантируем полную безопасность пересылки и бережное обращение с вашим устройством.",
            advantagesTitle: "Какова гарантия вашей поссылки?",
            advantages: [
                "Гарантия надежности доставки. Мы работаем только с проверенными и надежными курьерскими службами, чтобы ваши часы достигли нас в целости и сохранности. Хотя у нас нет собственной службы доставки, мы уверены в высоком уровне безопасности и ответственности партнеров, с которыми сотрудничаем. Все отправления застрахованы, и вы можете отслеживать путь своей посылки. Мы делаем все, чтобы процесс доставки был максимально удобным и надежным, и гарантируем, что ваши часы всегда будут в безопасности.",
            ],
            examplesTitle: "Примеры работ",

            buttons: {
                call: "Позвонить нам"
            }
        },

        expPage: {
            title: "Опыт",
            subtitle: "Мастер с более 20 летним опытом и с более 300 выполненых заказов",
            question: "Сколько лет я уже в этой сфере?",
            description1: "Я – опытный часовщик с более чем 20-летним стажем. Работаю с любыми видами часов – от классических механических до современных кварцевых и автоматических моделей. Любая поломка – это вызов, который я с удовольствием принимаю. Отреставрирую, настрою и верну вашим часам идеальную точность и внешний вид. Гарантирую качественный ремонт и индивидуальный подход к каждому заказу. Ваши часы – в надежных руках!",
            advantagesTitle: "Почему именно я?",
            advantages: [
                "20+ лет опыта – я занимаюсь ремонтом часов более двух десятилетий и знаю все тонкости работы с любыми механизмами. Ремонт любых часов – механика, кварц, автоматические модели, винтажные экземпляры – починю все! Честность и качество – только профессиональный подход, никаких лишних услуг и скрытых платежей. Индивидуальный подход – внимательно изучаю каждую проблему и нахожу наилучшее решение. Безопасная доставка – вы можете отправить мне свои часы, а я быстро их починю и верну в надежной упаковке. Доверьте свои часы профессионалу – и они снова будут работать идеально!"
            ],
            examplesTitle: "Примеры работ",
        
            buttons: {
                call: "Позвонить нам"
            }
        },

        examplesPage: {
            title: "Примеры работ",
            subtitle: "Лучшие примеры с качественными работами!",
        },

        NavigationLinks: {
            delivery: "Доставка",
            price: "Расценки",
            map: "Карта",
            services: "Услуги",
            works: "Работы",
            main: "Главная"
        },

        footerRedTxt: {
            text: "Принимаем заказы со всей Украины по почте"
        },

        allServices: {
            title: "Услуги",
            subtitle: "Услуги от Мастерской Время!",
            sectionHeading: "Услуги мастерской"
        },

        servicesRedTxt: {
            redText: "Берем на ремонт ЛЮБЫЕ часы всех марок и систем"
        },

    },
    ua: {
        siteHeading: {
            title: "Майстерня час"
        },

        repairForm: {
            title: "Записатися на ремонт",
            paragraph: "Запишіть ваші данні та ми з вами зв'яжемося як тільки зможемо, очікування може становити 1-2 дні",
            description: "Опис проблеми",
            name: "Ваше ім'я",
            email: "Ваш email",
            book: "Записатися",
            send: "Відправка...",
        },

        homePage: {
            title: "Ремонт годинників",
            subtitle: "Ремонт годинників у Харкові з якісним майстром",
            servicesTitle: "Послуги майстерні",
            experienceTitle: "Досвід майстра",
            pricingTitle: "Розцінки за послугу",
            examplesTitle: "Приклади робіт",
            findUsTitle: "Як нас знайти?",
            deliveryText: "ПРИЙМАЄМО ЗАМОВЛЕННЯ З УСІЄЇ УКРАЇНИ ПОШТОЮ!",
            description: "Я – досвідчений годинникар із більш ніж 20-річним стажем. Працюю з будь-якими видами годинників – від класичних механічних до сучасних кварцових та автоматичних моделей. Будь-яка поломка – це виклик, який я із задоволенням приймаю. Відреставрую, налаштую і поверну вашим годинникам ідеальну точність і зовнішній вигляд. Гарантую якісний ремонт та індивідуальний підхід до кожного замовлення. Ваш годинник – у надійних руках!",
            adress: "Адресса майстерні: Харків, Полтавський Шлях 31 офісний центр, офіс 311",
            buttons: {
              consultation: "Безкоштовна консультація",
              checkPrices: "Дізнатися розцінки",
              bookAppointment: "Записатися на консультацію",
              viewAllPrices: "Дивитися всі розцінки",
              viewMore: "Дивитися більше!",
            }
        },

        beforeAfter: {
            before: "До",
            after: "Після"
        },

        ServiceCards: {
            MechaicWatch: "Ремонт механічних годинників",
            Battery: "Заміна елементів живлення",
            Polishing: "Полірування годинників",
            Сleaning: "Чистка та змащування годинників",
            Straps: "Заміна ремінця або браслета",
            Capital: "Капітальний ремонт годинників"
            },

            ServicesList: {
                StrapReplacement: { name: "Заміна ремінця або браслета", price: "від 600 грн", duration: "1-2 дні" },
                BatteryReplacement: { name: "Заміна батарейки", price: "від 300 грн", duration: "1-2 дні" },
                GlassReplacement: { name: "Заміна скла", price: "від 400 грн", duration: "1-2 дні" },
                WaterproofProtection: { name: "Водонепроникний захист", price: "від 500 грн", duration: "2-3 дні" },
                Polishing: { name: "Полірування корпусу та браслета", price: "від 1000 грн", duration: "2-3 дні" },
                AccuracyCheck: { name: "Перевірка точності ходу", price: "від 200 грн", duration: "1-2 дні" },
                AntiqueRestoration: { name: "Реставрація антикварного годинника", price: "від 3000 грн", duration: "7+ днів" },
                WaterproofUpdate: { name: "Оновлення водозахисту", price: "від 800 грн", duration: "2-3 дні" },
                Overhaul: { name: "Капітальний ремонт годинника", price: "від 500 грн", duration: "2-3 дні" },
                HandsDialReplacement: { name: "Заміна стрілок і циферблата", price: "від 800 грн", duration: "2-3 дні" },
                CleaningLubrication: { name: "Чистка та змащення", price: "від 600 грн", duration: "1-2 дні" },
                ChronographRepair: { name: "Ремонт або заміна механізму хронографа", price: "від 2000 грн", duration: "3-4 дні" },
                PendulumClockRepair: { name: "Ремонт і налаштування механізму маятникового годинника", price: "від 600 грн", duration: "7+ днів" },
                MechanismRestoration: { name: "Відновлення механізму", price: "від 1000 грн", duration: "3+ дні" },
                PendulumMechanismRepair: { name: "Ремонт маятникових механізмів", price: "від 1200 грн", duration: "4+ дні" },
                AntiqueMechanismRepair: { name: "Ремонт і відновлення механізму старовинного годинника", price: "від 2000 грн", duration: "4-5 днів" },
                FullAntiqueCleaning: { name: "Повне розбирання та чистка старовинного годинника", price: "від 2000 грн", duration: "3-4 дні" }
            },
            

              form: {
                title: "Записатися на консультацію",
                namePlaceholder: "Ваше ім'я",
                phonePlaceholder: "Номер телефону",
                submitButton: "Записатися",
                waitMessage: "Зачекайте",
                successMessage: "Форму успішно відправлено!",
                errorMessage: "Помилка відправки. Спробуйте знову."
            },

        mechanicRepairPage: {
            title: "Ремонт механічних годинників",
            subtitle: "Годинники, які завжди йдуть точно",
            question: "Що таке механічні годинники?",
            description1: "Механічні годинники – це не просто інструмент вимірювання часу, а складний механізм, що потребує дбайливого догляду. У нашій майстерні ми проводимо комплексний ремонт годинників будь-якої складності: від очищення та змащення до заміни деталей і налаштування точності ходу. Досвідчені годинникарі працюють з увагою до кожної деталі, використовуючи професійне обладнання та оригінальні комплектуючі. Довірте нам ваш годинник – і він працюватиме бездоганно багато років!",
            advantagesTitle: "Переваги ремонту годинників у нас:",
            advantages: [
                "Продовження терміну служби – регулярне обслуговування запобігає серйозним поломкам.",
                "Точність ходу – налаштування механізму гарантує стабільну роботу без відхилень.",
                "Оригінальні деталі – використовуємо тільки перевірені комплектуючі.",
                "Гарантія якості – після ремонту ваш годинник працюватиме як новий.",
                "Досвідчені майстри – довіряйте професіоналам з багаторічним стажем."
            ],
            examplesTitle: "Приклади робіт",
        },



        poloshingPage: {
            title: "Полірування Годинників",
            subtitle: "Якісне полірування з різних матеріалів",
            
            explanatio1: "Що таке полірування годинників?",
            description1: "Полірування годинників – це процес видалення подряпин, потертостей і дрібних дефектів з корпусу та браслета годинника, щоб відновити його початковий блиск. Існує кілька видів полірування: Звичайне полірування – видаляє дрібні подряпини та повертає глянець. Сатинування (шліфування) – створює матову текстуру на металевих поверхнях. Глибока реставрація – включає усунення серйозніших пошкоджень і відновлення геометрії корпусу.",
        
            explanatio2: "Як виконується полірування годинників?",
            descriptionPoint2: "Полірування виконують вручну або на спеціальних верстатах, а для дорогих годинників використовують щадні методи, щоб зберегти оригінальні форми. Важливо не зловживати процедурою, оскільки часті полірування можуть стерти деталі корпусу.",
            sectionHeading: "Приклади робіт",


            buttons: {
                call: "Зателефонувати нам"
            }
        },

        marriagePage: { 
            title: "МАР'ЯЖ ГОДИННИКІВ МОЛНІЯ СРСР 3602",
            subtitle: "Друге життя легендарного механізму в новому образі.",  
            explanatio1: "Що таке мар'яж Молнії?", 
            description1: "Мар'яж — це мистецтво переродження класики. Ми беремо за основу легендарний механізм «Молнія» 3602, виготовлений в СРСР, і переносимо його з кишенькового корпусу в сучасний наручний. Це дозволяє не просто зберегти сімейну реліквію, а й перетворити її на стильний аксесуар, який зручно носити щодня. Наші майстри проводять повну профілактику калібру, щоб точність ходу відповідала найвищим стандартам. Довірте нам створення вашого унікального годинника з історією!",
            explanatio2: "Переваги мар'яжу у нас:",
            descriptionPoint1: "Легендарний механізм — працюємо з автентичними калібрами 3602, відомими своєю надійністю.",
            descriptionPoint2: "Індивідуальний дизайн — підбір корпусу, циферблата та стрілок під ваш персональний стиль.",
            descriptionPoint3: "Повне обслуговування — обов'язковий репасаж (чищення, змащування, налаштування) перед встановленням у корпус.",
            sectionHeading: "Приклади робіт"
        },

        pricePage: {
            title: "Розцінки",
            subtitle: "Найтехнологічніші роботи в Харкові",
            redText: "ПРИЙМАЄМО ЗАКАЗИ ЗІ ВСІЄЇ УКРАЇНИ ПОШТОЮ!",
            service: "Послуга",
            cost: "Ціна",
            duration: "Срок"
        },

        batteryPage: {
            title: "Заміна елементів живлення",
            subtitle: "Якісне полірування з різних матеріалів",
            
            explanatio1: "Що таке заміна елементів живлення?",
            description1: "Якщо ваш годинник зупинився або почав відставати, швидше за все, йому потрібна заміна елемента живлення. Ми професійно замінимо батарейку у будь-яких наручних, кишенькових і настінних годинниках, використовуючи якісні джерела живлення, що відповідають вашому механізму. Процедура виконується акуратно, з перевіркою контактів і герметичності корпусу, щоб годинник знову працював без збоїв. Довірте нам заміну батарейки – і ваш годинник прослужить ще багато років!",
        
            explanatio2: "Переваги заміни батарейки у нас:",
            descriptionPoin1: "Швидко і безпечно – заміна займає всього кілька хвилин.",
            descriptionPoin2: "Оригінальні батарейки – використовуємо тільки перевірені та довговічні елементи.",
            descriptionPoin3: "Збереження герметичності – перевіряємо і відновлюємо захист від вологи.",
            descriptionPoin4: "Продовження життя механізму – своєчасна заміна запобігає окисленню контактів.",
            descriptionPoin5: "Гарантія на роботу – впевнені у якості кожної заміни!",
            sectionHeading: "Приклади робіт",
        
            buttons: {
                call: "Зателефонувати нам"
            }
        },

        cleaningPage: {
            title: "Чистка та змащування годинника",
            subtitle: "Підтримуємо ваш механізм у відмінному стані",
            
            explanatio1: "Що таке змащування та чистка годинника?",
            description1: "З часом у механізмі годинника накопичуються пил та мікрочастинки, які погіршують роботу і точність ходу. Змащення висихає, що призводить до зношування деталей. Професійна чистка та змащування допомагають відновити ідеальну роботу механізму. У нашій майстерні ми акуратно розбираємо годинник, очищаємо всі елементи, оновлюємо змащення та збираємо його заново, щоб продовжити термін служби і повернути точність.",
        
            explanatio2: "Переваги змащування та чистки годинника у нас:",
            descriptionPoin1: "Продовження терміну служби – регулярний догляд запобігає зношуванню деталей.",
            descriptionPoin2: "Ідеальна точність – усунення забруднень відновлює стабільний хід.",
            descriptionPoin3: "Оригінальні змащувальні матеріали – використовуємо тільки якісні масла.",
            descriptionPoin4: "Безпека процесу – чистка проводиться професійними інструментами.",
            descriptionPoin5: "Гарантія результату – ваш годинник працюватиме, як новий!",
            sectionHeading: "Приклади робіт",
        
            buttons: {
                call: "Зателефонувати нам"
            }
        },

        strapPage: {
            title: "Заміна ремінця або браслета",
            subtitle: "Люксові ремінці преміальної якості",
            
            explanatio1: "Що таке ремінець?",
            description1: "Ремінець – це не лише функціональна частина годинника, а й важливий елемент його стилю. З часом він зношується, втрачає зовнішній вигляд або просто перестає бути зручним. Ми допоможемо підібрати та замінити ремінець або браслет на новий – шкіряний, силіконовий, тканинний чи металевий. Заміна проводиться акуратно, з урахуванням особливостей кріплення, щоб годинник надійно сидів на руці та виглядав бездоганно.",
        
            explanatio2: "Переваги заміни ремінця саме у нас",
            descriptionPoin1: "Широкий вибір – шкіряні, металеві, силіконові та інші варіанти.",
            descriptionPoin2: "Ідеальна посадка – підбираємо та регулюємо ремінець для максимального комфорту.",
            descriptionPoin3: "Якість та надійність – працюємо лише з перевіреними матеріалами.",
            descriptionPoin4: "Швидка заміна – установка займає всього кілька хвилин.",
            descriptionPoin5: "Оновлений стиль – зробіть ваш годинник ще елегантнішим і зручнішим.",
            sectionHeading: "Приклади робіт",
        
            buttons: {
                call: "Зателефонувати нам"
            }
        },
        
        capital: {
            title: "Капітальний ремонт годинника",
            subtitle: "Капітальний ремонт з приємними майстрами",
            
            explanatio1: "Що таке капітальний ремонт годинника?",
            description1: "Капітальний ремонт годинника – це комплексна процедура, що дозволяє відновити його точність і продовжити термін служби. З часом деталі зношуються, мастило втрачає властивості, а механізми забруднюються. Під час ремонту ми повністю розбираємо годинник, очищуємо та змащуємо кожну деталь, замінюємо зношені елементи та налаштовуємо точність ходу. Після капітального ремонту ваш годинник знову працюватиме, як новий!",
        
            explanatio2: "Переваги капітального ремонту у нас:",
            descriptionPoin1: "Повне відновлення механізму – усуваємо всі можливі несправності.",
            descriptionPoin2: "Точність ходу – після регулювання годинник працюватиме без відхилень.",
            descriptionPoin3: "Заміна зношених деталей – використовуємо лише оригінальні або аналогічні комплектуючі.",
            descriptionPoin4: "Професійне чищення та змащування – механізму повертається плавність роботи.",
            descriptionPoin5: "Гарантія якості – впевнені в результаті кожного ремонту!",
            sectionHeading: "Приклади робіт",
        
            buttons: {
                call: "Зателефонувати нам"
            }
        },

        delivery: {
            title: "Доставка",
            subtitle: "Гарантуємо збереження та швидкість",
            question: "Якими поштовими службами можна відправити годинник?",
            description1: "Ви можете надіслати нам ваш товар будь-якою зручною поштовою службою. Ми виконаємо ремонт максимально швидко та надішлемо його назад у надійній упаковці. Гарантуємо повну безпеку пересилки та дбайливе поводження з вашим пристроєм.",
            advantagesTitle: "Яка гарантія вашої посилки?",
            advantages: [
                "Гарантія надійності доставки. Ми працюємо тільки з перевіреними та надійними кур'єрськими службами, щоб ваш годинник дістався до нас у цілості й схоронності. Хоча у нас немає власної служби доставки, ми впевнені у високому рівні безпеки та відповідальності партнерів, з якими співпрацюємо. Усі відправлення застраховані, і ви можете відстежувати шлях своєї посилки. Ми робимо все, щоб процес доставки був максимально зручним і надійним, і гарантуємо, що ваш годинник завжди буде в безпеці."
            ],
            examplesTitle: "Приклади робіт",
        
            buttons: {
                call: "Зателефонувати нам"
            }
        },

        expPage: {
            title: "Досвід",
            subtitle: "Майстер з більш ніж 20-річним досвідом і понад 300 виконаними замовленнями",
            question: "Скільки років я вже в цій сфері?",
            description1: "Я – досвідчений годинникар з більш ніж 20-річним стажем. Працюю з будь-якими видами годинників – від класичних механічних до сучасних кварцових і автоматичних моделей. Будь-яка поломка – це виклик, який я з радістю приймаю. Відреставрую, налаштую і поверну вашим годинникам ідеальну точність і зовнішній вигляд. Гарантую якісний ремонт та індивідуальний підхід до кожного замовлення. Ваші годинники – в надійних руках!",
            advantagesTitle: "Чому саме я?",
            advantages: [
                "20+ років досвіду – я займаюся ремонтом годинників понад два десятиліття і знаю всі тонкощі роботи з будь-якими механізмами. Ремонт будь-яких годинників – механіка, кварц, автоматичні моделі, вінтажні екземпляри – відремонтую все! Чесність і якість – тільки професійний підхід, жодних зайвих послуг і прихованих платежів. Індивідуальний підхід – ретельно вивчаю кожну проблему і знаходжу найкраще рішення. Безпечна доставка – ви можете надіслати мені свої годинники, а я швидко їх відремонтую і поверну в надійній упаковці. Довірте свої годинники професіоналу – і вони знову працюватимуть ідеально!"
            ],
            examplesTitle: "Приклади робіт",
        
            buttons: {
                call: "Зателефонувати нам"
            }
        },

        examplesPage: {
            title: "Приклади робіт",
            subtitle: "Найкращі приклади з якісними работами",
        },
        
        NavigationLinks: {
            delivery: "Доставка",
            price: "Ціни",
            map: "Мапа",
            services: "Послуги",
            works: "Роботи",
            main: "Головна"
        },
        
        footerRedTxt: {
            text: "Приймаємо закази зі всієї України поштою"
        }, 

        allServices: {
            title: "Послуги",
            subtitle: "Послуги від Майстерні Час!",
            sectionHeading: "Послуги майстерні"
        },

        servicesRedTxt: {
            redText: "Беремо на ремонт Будь-які годинники усіх марок та систем"
        },
    }
  };
  
  export default translations;
  